Model Summary

Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_64 (Conv2D)           (64, 32, 32, 64)          1792      
_________________________________________________________________
leaky_re_lu_72 (LeakyReLU)   (64, 32, 32, 64)          0         
_________________________________________________________________
conv2d_65 (Conv2D)           (64, 32, 32, 64)          36928     
_________________________________________________________________
leaky_re_lu_73 (LeakyReLU)   (64, 32, 32, 64)          0         
_________________________________________________________________
fractional_pooling2d_24 (Fra (64, 20, 20, 64)          0         
_________________________________________________________________
conv2d_66 (Conv2D)           (64, 20, 20, 128)         73856     
_________________________________________________________________
leaky_re_lu_74 (LeakyReLU)   (64, 20, 20, 128)         0         
_________________________________________________________________
conv2d_67 (Conv2D)           (64, 20, 20, 128)         147584    
_________________________________________________________________
leaky_re_lu_75 (LeakyReLU)   (64, 20, 20, 128)         0         
_________________________________________________________________
fractional_pooling2d_25 (Fra (64, 16, 16, 128)         0         
_________________________________________________________________
conv2d_68 (Conv2D)           (64, 16, 16, 256)         295168    
_________________________________________________________________
leaky_re_lu_76 (LeakyReLU)   (64, 16, 16, 256)         0         
_________________________________________________________________
conv2d_69 (Conv2D)           (64, 16, 16, 256)         590080    
_________________________________________________________________
leaky_re_lu_77 (LeakyReLU)   (64, 16, 16, 256)         0         
_________________________________________________________________
conv2d_70 (Conv2D)           (64, 16, 16, 256)         590080    
_________________________________________________________________
leaky_re_lu_78 (LeakyReLU)   (64, 16, 16, 256)         0         
_________________________________________________________________
fractional_pooling2d_26 (Fra (64, 10, 10, 256)         0         
_________________________________________________________________
conv2d_71 (Conv2D)           (64, 10, 10, 256)         590080    
_________________________________________________________________
leaky_re_lu_79 (LeakyReLU)   (64, 10, 10, 256)         0         
_________________________________________________________________
conv2d_72 (Conv2D)           (64, 10, 10, 256)         590080    
_________________________________________________________________
leaky_re_lu_80 (LeakyReLU)   (64, 10, 10, 256)         0         
_________________________________________________________________
conv2d_73 (Conv2D)           (64, 10, 10, 256)         590080    
_________________________________________________________________
leaky_re_lu_81 (LeakyReLU)   (64, 10, 10, 256)         0         
_________________________________________________________________
fractional_pooling2d_27 (Fra (64, 8, 8, 256)           0         
_________________________________________________________________
conv2d_74 (Conv2D)           (64, 8, 8, 512)           1180160   
_________________________________________________________________
leaky_re_lu_82 (LeakyReLU)   (64, 8, 8, 512)           0         
_________________________________________________________________
conv2d_75 (Conv2D)           (64, 8, 8, 512)           2359808   
_________________________________________________________________
leaky_re_lu_83 (LeakyReLU)   (64, 8, 8, 512)           0         
_________________________________________________________________
conv2d_76 (Conv2D)           (64, 8, 8, 512)           2359808   
_________________________________________________________________
leaky_re_lu_84 (LeakyReLU)   (64, 8, 8, 512)           0         
_________________________________________________________________
fractional_pooling2d_28 (Fra (64, 5, 5, 512)           0         
_________________________________________________________________
conv2d_77 (Conv2D)           (64, 5, 5, 512)           2359808   
_________________________________________________________________
leaky_re_lu_85 (LeakyReLU)   (64, 5, 5, 512)           0         
_________________________________________________________________
conv2d_78 (Conv2D)           (64, 5, 5, 512)           2359808   
_________________________________________________________________
leaky_re_lu_86 (LeakyReLU)   (64, 5, 5, 512)           0         
_________________________________________________________________
conv2d_79 (Conv2D)           (64, 5, 5, 512)           2359808   
_________________________________________________________________
leaky_re_lu_87 (LeakyReLU)   (64, 5, 5, 512)           0         
_________________________________________________________________
fractional_pooling2d_29 (Fra (64, 4, 4, 512)           0         
_________________________________________________________________
flatten_4 (Flatten)          (64, 8192)                0         
_________________________________________________________________
dense_10 (Dense)             (64, 4096)                33558528  
_________________________________________________________________
leaky_re_lu_88 (LeakyReLU)   (64, 4096)                0         
_________________________________________________________________
dense_11 (Dense)             (64, 4096)                16781312  
_________________________________________________________________
leaky_re_lu_89 (LeakyReLU)   (64, 4096)                0         
_________________________________________________________________
dense_12 (Dense)             (64, 10)                  40970     
=================================================================
Total params: 66,865,738
Trainable params: 66,865,738
Non-trainable params: 0
_________________________________________________________________

Train for 100 steps, validate for 3 steps
Epoch 1/50
 99/100 [============================>.] - ETA: 0s - loss: 2.3026 - accuracy: 0.1026
Epoch 00001: val_loss improved from inf to 2.30238, saving model to Model.hdf5
100/100 [==============================] - 45s 449ms/step - loss: 2.3025 - accuracy: 0.1037 - val_loss: 2.3024 - val_accuracy: 0.1005
Epoch 2/50
 99/100 [============================>.] - ETA: 0s - loss: 2.2994 - accuracy: 0.1165
Epoch 00002: val_loss improved from 2.30238 to 2.28060, saving model to Model.hdf5
100/100 [==============================] - 44s 437ms/step - loss: 2.2992 - accuracy: 0.1163 - val_loss: 2.2806 - val_accuracy: 0.1282
Epoch 3/50
 99/100 [============================>.] - ETA: 0s - loss: 2.2971 - accuracy: 0.1166
Epoch 00003: val_loss did not improve from 2.28060
100/100 [==============================] - 41s 406ms/step - loss: 2.2971 - accuracy: 0.1163 - val_loss: 2.3032 - val_accuracy: 0.1006
Epoch 4/50
 99/100 [============================>.] - ETA: 0s - loss: 2.2697 - accuracy: 0.1327
Epoch 00004: val_loss improved from 2.28060 to 2.25155, saving model to Model.hdf5
100/100 [==============================] - 43s 433ms/step - loss: 2.2703 - accuracy: 0.1325 - val_loss: 2.2515 - val_accuracy: 0.1356
Epoch 5/50
 99/100 [============================>.] - ETA: 0s - loss: 2.1573 - accuracy: 0.1985
Epoch 00005: val_loss did not improve from 2.25155
100/100 [==============================] - 41s 407ms/step - loss: 2.1569 - accuracy: 0.1989 - val_loss: 2.2943 - val_accuracy: 0.1901
Epoch 6/50
 99/100 [============================>.] - ETA: 0s - loss: 2.0755 - accuracy: 0.2295
Epoch 00006: val_loss improved from 2.25155 to 2.01352, saving model to Model.hdf5
100/100 [==============================] - 43s 434ms/step - loss: 2.0742 - accuracy: 0.2303 - val_loss: 2.0135 - val_accuracy: 0.2382
Epoch 7/50
 99/100 [============================>.] - ETA: 0s - loss: 2.0331 - accuracy: 0.2511
Epoch 00007: val_loss improved from 2.01352 to 2.00343, saving model to Model.hdf5
100/100 [==============================] - 44s 437ms/step - loss: 2.0324 - accuracy: 0.2506 - val_loss: 2.0034 - val_accuracy: 0.2641
Epoch 8/50
 99/100 [============================>.] - ETA: 0s - loss: 2.0013 - accuracy: 0.2522
Epoch 00008: val_loss improved from 2.00343 to 1.92221, saving model to Model.hdf5
100/100 [==============================] - 44s 438ms/step - loss: 2.0021 - accuracy: 0.2525 - val_loss: 1.9222 - val_accuracy: 0.2881
Epoch 9/50
 99/100 [============================>.] - ETA: 0s - loss: 1.9452 - accuracy: 0.2659
Epoch 00009: val_loss did not improve from 1.92221
100/100 [==============================] - 40s 404ms/step - loss: 1.9470 - accuracy: 0.2657 - val_loss: 2.1779 - val_accuracy: 0.2281
Epoch 10/50
 99/100 [============================>.] - ETA: 0s - loss: 1.9068 - accuracy: 0.2797
Epoch 00010: val_loss improved from 1.92221 to 1.81964, saving model to Model.hdf5
100/100 [==============================] - 43s 431ms/step - loss: 1.9059 - accuracy: 0.2794 - val_loss: 1.8196 - val_accuracy: 0.3114
Epoch 11/50
 99/100 [============================>.] - ETA: 0s - loss: 1.8346 - accuracy: 0.3037
Epoch 00011: val_loss did not improve from 1.81964
100/100 [==============================] - 40s 400ms/step - loss: 1.8338 - accuracy: 0.3050 - val_loss: 1.8503 - val_accuracy: 0.3121
Epoch 12/50
 99/100 [============================>.] - ETA: 0s - loss: 1.8084 - accuracy: 0.3218
Epoch 00012: val_loss improved from 1.81964 to 1.72272, saving model to Model.hdf5
100/100 [==============================] - 43s 428ms/step - loss: 1.8074 - accuracy: 0.3220 - val_loss: 1.7227 - val_accuracy: 0.3472
Epoch 13/50
 99/100 [============================>.] - ETA: 0s - loss: 1.7763 - accuracy: 0.3384
Epoch 00013: val_loss did not improve from 1.72272
100/100 [==============================] - 41s 406ms/step - loss: 1.7761 - accuracy: 0.3388 - val_loss: 1.7663 - val_accuracy: 0.3376
Epoch 14/50
 99/100 [============================>.] - ETA: 0s - loss: 1.7224 - accuracy: 0.3633
Epoch 00014: val_loss improved from 1.72272 to 1.63984, saving model to Model.hdf5
100/100 [==============================] - 43s 433ms/step - loss: 1.7227 - accuracy: 0.3636 - val_loss: 1.6398 - val_accuracy: 0.3871
Epoch 15/50
 99/100 [============================>.] - ETA: 0s - loss: 1.6711 - accuracy: 0.3824
Epoch 00015: val_loss did not improve from 1.63984
100/100 [==============================] - 40s 404ms/step - loss: 1.6697 - accuracy: 0.3823 - val_loss: 1.7411 - val_accuracy: 0.3471
Epoch 16/50
 99/100 [============================>.] - ETA: 0s - loss: 1.6326 - accuracy: 0.3927
Epoch 00016: val_loss improved from 1.63984 to 1.59021, saving model to Model.hdf5
100/100 [==============================] - 43s 431ms/step - loss: 1.6329 - accuracy: 0.3934 - val_loss: 1.5902 - val_accuracy: 0.4147
Epoch 17/50
 99/100 [============================>.] - ETA: 0s - loss: 1.5899 - accuracy: 0.4045
Epoch 00017: val_loss improved from 1.59021 to 1.50988, saving model to Model.hdf5
100/100 [==============================] - 43s 432ms/step - loss: 1.5892 - accuracy: 0.4050 - val_loss: 1.5099 - val_accuracy: 0.4329
Epoch 18/50
 99/100 [============================>.] - ETA: 0s - loss: 1.5582 - accuracy: 0.4178
Epoch 00018: val_loss did not improve from 1.50988
100/100 [==============================] - 40s 402ms/step - loss: 1.5564 - accuracy: 0.4183 - val_loss: 1.5832 - val_accuracy: 0.4141
Epoch 19/50
 99/100 [============================>.] - ETA: 0s - loss: 1.5197 - accuracy: 0.4320
Epoch 00019: val_loss improved from 1.50988 to 1.42014, saving model to Model.hdf5
100/100 [==============================] - 43s 430ms/step - loss: 1.5212 - accuracy: 0.4319 - val_loss: 1.4201 - val_accuracy: 0.4702
Epoch 20/50
 99/100 [============================>.] - ETA: 0s - loss: 1.4856 - accuracy: 0.4432
Epoch 00020: val_loss improved from 1.42014 to 1.39720, saving model to Model.hdf5
100/100 [==============================] - 43s 431ms/step - loss: 1.4853 - accuracy: 0.4431 - val_loss: 1.3972 - val_accuracy: 0.4878
Epoch 21/50
 99/100 [============================>.] - ETA: 0s - loss: 1.4472 - accuracy: 0.4646
Epoch 00021: val_loss did not improve from 1.39720
100/100 [==============================] - 41s 406ms/step - loss: 1.4480 - accuracy: 0.4645 - val_loss: 1.5557 - val_accuracy: 0.4210
Epoch 22/50
 99/100 [============================>.] - ETA: 0s - loss: 1.4344 - accuracy: 0.4765
Epoch 00022: val_loss did not improve from 1.39720
100/100 [==============================] - 40s 403ms/step - loss: 1.4345 - accuracy: 0.4761 - val_loss: 1.4101 - val_accuracy: 0.4579
Epoch 23/50
 99/100 [============================>.] - ETA: 0s - loss: 1.3972 - accuracy: 0.4852
Epoch 00023: val_loss improved from 1.39720 to 1.37065, saving model to Model.hdf5
100/100 [==============================] - 43s 431ms/step - loss: 1.3983 - accuracy: 0.4853 - val_loss: 1.3707 - val_accuracy: 0.4927
Epoch 24/50
 99/100 [============================>.] - ETA: 0s - loss: 1.3805 - accuracy: 0.4898
Epoch 00024: val_loss improved from 1.37065 to 1.28971, saving model to Model.hdf5
100/100 [==============================] - 43s 432ms/step - loss: 1.3791 - accuracy: 0.4907 - val_loss: 1.2897 - val_accuracy: 0.5265
Epoch 25/50
 99/100 [============================>.] - ETA: 0s - loss: 1.3499 - accuracy: 0.5057
Epoch 00025: val_loss did not improve from 1.28971
100/100 [==============================] - 40s 398ms/step - loss: 1.3503 - accuracy: 0.5058 - val_loss: 1.3567 - val_accuracy: 0.5106
Epoch 26/50
 99/100 [============================>.] - ETA: 0s - loss: 1.3162 - accuracy: 0.5241
Epoch 00026: val_loss improved from 1.28971 to 1.26371, saving model to Model.hdf5
100/100 [==============================] - 42s 424ms/step - loss: 1.3161 - accuracy: 0.5242 - val_loss: 1.2637 - val_accuracy: 0.5411
Epoch 27/50
 99/100 [============================>.] - ETA: 0s - loss: 1.3286 - accuracy: 0.5104
Epoch 00027: val_loss improved from 1.26371 to 1.21472, saving model to Model.hdf5
100/100 [==============================] - 42s 421ms/step - loss: 1.3272 - accuracy: 0.5102 - val_loss: 1.2147 - val_accuracy: 0.5550
Epoch 28/50
 99/100 [============================>.] - ETA: 0s - loss: 1.2605 - accuracy: 0.5349
Epoch 00028: val_loss did not improve from 1.21472
100/100 [==============================] - 39s 393ms/step - loss: 1.2598 - accuracy: 0.5352 - val_loss: 1.4358 - val_accuracy: 0.4891
Epoch 29/50
 99/100 [============================>.] - ETA: 0s - loss: 1.2415 - accuracy: 0.5448
Epoch 00029: val_loss did not improve from 1.21472
100/100 [==============================] - 39s 390ms/step - loss: 1.2424 - accuracy: 0.5448 - val_loss: 1.2828 - val_accuracy: 0.5420
Epoch 30/50
 99/100 [============================>.] - ETA: 0s - loss: 1.2323 - accuracy: 0.5537
Epoch 00030: val_loss improved from 1.21472 to 1.19132, saving model to Model.hdf5
100/100 [==============================] - 42s 422ms/step - loss: 1.2321 - accuracy: 0.5536 - val_loss: 1.1913 - val_accuracy: 0.5672
Epoch 31/50
 99/100 [============================>.] - ETA: 0s - loss: 1.1947 - accuracy: 0.5679
Epoch 00031: val_loss improved from 1.19132 to 1.16540, saving model to Model.hdf5
100/100 [==============================] - 42s 417ms/step - loss: 1.1941 - accuracy: 0.5678 - val_loss: 1.1654 - val_accuracy: 0.5673
Epoch 32/50
 99/100 [============================>.] - ETA: 0s - loss: 1.1821 - accuracy: 0.5781
Epoch 00032: val_loss improved from 1.16540 to 1.16292, saving model to Model.hdf5
100/100 [==============================] - 42s 422ms/step - loss: 1.1836 - accuracy: 0.5775 - val_loss: 1.1629 - val_accuracy: 0.5766
Epoch 33/50
 99/100 [============================>.] - ETA: 0s - loss: 1.1566 - accuracy: 0.5745
Epoch 00033: val_loss did not improve from 1.16292
100/100 [==============================] - 39s 391ms/step - loss: 1.1573 - accuracy: 0.5755 - val_loss: 1.2037 - val_accuracy: 0.5691
Epoch 34/50
 99/100 [============================>.] - ETA: 0s - loss: 1.1006 - accuracy: 0.6078
Epoch 00034: val_loss improved from 1.16292 to 1.11970, saving model to Model.hdf5
100/100 [==============================] - 42s 419ms/step - loss: 1.1026 - accuracy: 0.6069 - val_loss: 1.1197 - val_accuracy: 0.5954
Epoch 35/50
 99/100 [============================>.] - ETA: 0s - loss: 1.1042 - accuracy: 0.5993
Epoch 00035: val_loss did not improve from 1.11970
100/100 [==============================] - 39s 386ms/step - loss: 1.1060 - accuracy: 0.5981 - val_loss: 1.1341 - val_accuracy: 0.5886
Epoch 36/50
 99/100 [============================>.] - ETA: 0s - loss: 1.0894 - accuracy: 0.6078
Epoch 00036: val_loss improved from 1.11970 to 1.10444, saving model to Model.hdf5
100/100 [==============================] - 41s 412ms/step - loss: 1.0923 - accuracy: 0.6077 - val_loss: 1.1044 - val_accuracy: 0.6049
Epoch 37/50
 99/100 [============================>.] - ETA: 0s - loss: 1.0631 - accuracy: 0.6135
Epoch 00037: val_loss improved from 1.10444 to 1.00145, saving model to Model.hdf5
100/100 [==============================] - 42s 416ms/step - loss: 1.0615 - accuracy: 0.6139 - val_loss: 1.0014 - val_accuracy: 0.6429
Epoch 38/50
 99/100 [============================>.] - ETA: 0s - loss: 1.0468 - accuracy: 0.6244
Epoch 00038: val_loss did not improve from 1.00145
100/100 [==============================] - 39s 392ms/step - loss: 1.0464 - accuracy: 0.6247 - val_loss: 1.0808 - val_accuracy: 0.6075
Epoch 39/50
 99/100 [============================>.] - ETA: 0s - loss: 1.0530 - accuracy: 0.6222
Epoch 00039: val_loss did not improve from 1.00145
100/100 [==============================] - 40s 395ms/step - loss: 1.0512 - accuracy: 0.6234 - val_loss: 1.1469 - val_accuracy: 0.6022
Epoch 40/50
 99/100 [============================>.] - ETA: 0s - loss: 0.9766 - accuracy: 0.6443
Epoch 00040: val_loss improved from 1.00145 to 0.96993, saving model to Model.hdf5
100/100 [==============================] - 42s 422ms/step - loss: 0.9778 - accuracy: 0.6441 - val_loss: 0.9699 - val_accuracy: 0.6519
Epoch 41/50
 99/100 [============================>.] - ETA: 0s - loss: 0.9745 - accuracy: 0.6529
Epoch 00041: val_loss did not improve from 0.96993
100/100 [==============================] - 39s 389ms/step - loss: 0.9743 - accuracy: 0.6531 - val_loss: 0.9804 - val_accuracy: 0.6534
Epoch 42/50
 99/100 [============================>.] - ETA: 0s - loss: 0.9594 - accuracy: 0.6651
Epoch 00042: val_loss improved from 0.96993 to 0.96871, saving model to Model.hdf5
100/100 [==============================] - 42s 416ms/step - loss: 0.9562 - accuracy: 0.6658 - val_loss: 0.9687 - val_accuracy: 0.6586
Epoch 43/50
 99/100 [============================>.] - ETA: 0s - loss: 0.9520 - accuracy: 0.6627
Epoch 00043: val_loss improved from 0.96871 to 0.92933, saving model to Model.hdf5
100/100 [==============================] - 42s 422ms/step - loss: 0.9502 - accuracy: 0.6636 - val_loss: 0.9293 - val_accuracy: 0.6619
Epoch 44/50
 99/100 [============================>.] - ETA: 0s - loss: 0.9457 - accuracy: 0.6526
Epoch 00044: val_loss did not improve from 0.92933
100/100 [==============================] - 39s 393ms/step - loss: 0.9446 - accuracy: 0.6533 - val_loss: 0.9642 - val_accuracy: 0.6531
Epoch 45/50
 99/100 [============================>.] - ETA: 0s - loss: 0.9316 - accuracy: 0.6654
Epoch 00045: val_loss improved from 0.92933 to 0.91215, saving model to Model.hdf5
100/100 [==============================] - 42s 419ms/step - loss: 0.9315 - accuracy: 0.6659 - val_loss: 0.9122 - val_accuracy: 0.6747
Epoch 46/50
 99/100 [============================>.] - ETA: 0s - loss: 0.9238 - accuracy: 0.6656
Epoch 00046: val_loss did not improve from 0.91215
100/100 [==============================] - 39s 388ms/step - loss: 0.9233 - accuracy: 0.6655 - val_loss: 0.9177 - val_accuracy: 0.6700
Epoch 47/50
 99/100 [============================>.] - ETA: 0s - loss: 0.9038 - accuracy: 0.6772
Epoch 00047: val_loss did not improve from 0.91215
100/100 [==============================] - 39s 393ms/step - loss: 0.9037 - accuracy: 0.6780 - val_loss: 0.9256 - val_accuracy: 0.6764
Epoch 48/50
 99/100 [============================>.] - ETA: 0s - loss: 0.8572 - accuracy: 0.6943
Epoch 00048: val_loss improved from 0.91215 to 0.88841, saving model to Model.hdf5
100/100 [==============================] - 42s 420ms/step - loss: 0.8598 - accuracy: 0.6934 - val_loss: 0.8884 - val_accuracy: 0.6856
Epoch 49/50
 99/100 [============================>.] - ETA: 0s - loss: 0.8509 - accuracy: 0.6993
Epoch 00049: val_loss improved from 0.88841 to 0.84606, saving model to Model.hdf5
100/100 [==============================] - 43s 435ms/step - loss: 0.8500 - accuracy: 0.7000 - val_loss: 0.8461 - val_accuracy: 0.7014
Epoch 50/50
 99/100 [============================>.] - ETA: 0s - loss: 0.8208 - accuracy: 0.7050
Epoch 00050: val_loss did not improve from 0.84606
100/100 [==============================] - 40s 403ms/step - loss: 0.8201 - accuracy: 0.7052 - val_loss: 0.9417 - val_accuracy: 0.6724


