Model Summary


Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (64, 32, 32, 64)          1792      
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (64, 32, 32, 64)          0         
_________________________________________________________________
conv2d_1 (Conv2D)            (64, 32, 32, 64)          36928     
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (64, 32, 32, 64)          0         
_________________________________________________________________
fractional_pooling2d (Fracti (64, 20, 20, 64)          0         
_________________________________________________________________
conv2d_2 (Conv2D)            (64, 20, 20, 128)         73856     
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (64, 20, 20, 128)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (64, 20, 20, 128)         147584    
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (64, 20, 20, 128)         0         
_________________________________________________________________
fractional_pooling2d_1 (Frac (64, 16, 16, 128)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (64, 16, 16, 256)         295168    
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (64, 16, 16, 256)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (64, 16, 16, 256)         590080    
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (64, 16, 16, 256)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (64, 16, 16, 256)         590080    
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (64, 16, 16, 256)         0         
_________________________________________________________________
fractional_pooling2d_2 (Frac (64, 10, 10, 256)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (64, 10, 10, 256)         590080    
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (64, 10, 10, 256)         0         
_________________________________________________________________
conv2d_8 (Conv2D)            (64, 10, 10, 256)         590080    
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (64, 10, 10, 256)         0         
_________________________________________________________________
conv2d_9 (Conv2D)            (64, 10, 10, 256)         590080    
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (64, 10, 10, 256)         0         
_________________________________________________________________
fractional_pooling2d_3 (Frac (64, 8, 8, 256)           0         
_________________________________________________________________
conv2d_10 (Conv2D)           (64, 8, 8, 512)           1180160   
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (64, 8, 8, 512)           0         
_________________________________________________________________
conv2d_11 (Conv2D)           (64, 8, 8, 512)           2359808   
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (64, 8, 8, 512)           0         
_________________________________________________________________
conv2d_12 (Conv2D)           (64, 8, 8, 512)           2359808   
_________________________________________________________________
leaky_re_lu_12 (LeakyReLU)   (64, 8, 8, 512)           0         
_________________________________________________________________
fractional_pooling2d_4 (Frac (64, 5, 5, 512)           0         
_________________________________________________________________
conv2d_13 (Conv2D)           (64, 5, 5, 512)           2359808   
_________________________________________________________________
leaky_re_lu_13 (LeakyReLU)   (64, 5, 5, 512)           0         
_________________________________________________________________
conv2d_14 (Conv2D)           (64, 5, 5, 512)           2359808   
_________________________________________________________________
leaky_re_lu_14 (LeakyReLU)   (64, 5, 5, 512)           0         
_________________________________________________________________
conv2d_15 (Conv2D)           (64, 5, 5, 512)           2359808   
_________________________________________________________________
leaky_re_lu_15 (LeakyReLU)   (64, 5, 5, 512)           0         
_________________________________________________________________
fractional_pooling2d_5 (Frac (64, 4, 4, 512)           0         
_________________________________________________________________
flatten (Flatten)            (64, 8192)                0         
_________________________________________________________________
dense (Dense)                (64, 4096)                33558528  
_________________________________________________________________
leaky_re_lu_16 (LeakyReLU)   (64, 4096)                0         
_________________________________________________________________
dense_1 (Dense)              (64, 4096)                16781312  
_________________________________________________________________
leaky_re_lu_17 (LeakyReLU)   (64, 4096)                0         
_________________________________________________________________
dense_2 (Dense)              (64, 10)                  40970     
=================================================================
Total params: 66,865,738
Trainable params: 66,865,738
Non-trainable params: 0


Training Details

Train on 49984 samples, validate on 9984 samples
Epoch 1/10
49920/49984 [============================>.] - ETA: 0s - loss: 2.2428 - accuracy: 0.1393
Epoch 00001: val_loss improved from inf to 1.97072, saving model to Model.hdf5
49984/49984 [==============================] - 282s 6ms/sample - loss: 2.2424 - accuracy: 0.1395 - val_loss: 1.9707 - val_accuracy: 0.2623
Epoch 2/10
49920/49984 [============================>.] - ETA: 0s - loss: 1.8644 - accuracy: 0.3001
Epoch 00002: val_loss improved from 1.97072 to 1.69029, saving model to Model.hdf5
49984/49984 [==============================] - 281s 6ms/sample - loss: 1.8640 - accuracy: 0.3003 - val_loss: 1.6903 - val_accuracy: 0.3738
Epoch 3/10
49920/49984 [============================>.] - ETA: 0s - loss: 1.5862 - accuracy: 0.4086
Epoch 00003: val_loss improved from 1.69029 to 1.42427, saving model to Model.hdf5
49984/49984 [==============================] - 282s 6ms/sample - loss: 1.5859 - accuracy: 0.4086 - val_loss: 1.4243 - val_accuracy: 0.4674
Epoch 4/10
49920/49984 [============================>.] - ETA: 0s - loss: 1.3658 - accuracy: 0.4988
Epoch 00004: val_loss improved from 1.42427 to 1.21909, saving model to Model.hdf5
49984/49984 [==============================] - 281s 6ms/sample - loss: 1.3655 - accuracy: 0.4989 - val_loss: 1.2191 - val_accuracy: 0.5570
Epoch 5/10
49920/49984 [============================>.] - ETA: 0s - loss: 1.1753 - accuracy: 0.5762
Epoch 00005: val_loss improved from 1.21909 to 1.08155, saving model to Model.hdf5
49984/49984 [==============================] - 281s 6ms/sample - loss: 1.1755 - accuracy: 0.5762 - val_loss: 1.0815 - val_accuracy: 0.6128
Epoch 6/10
49920/49984 [============================>.] - ETA: 0s - loss: 1.0218 - accuracy: 0.6317
Epoch 00006: val_loss improved from 1.08155 to 0.94729, saving model to Model.hdf5
49984/49984 [==============================] - 279s 6ms/sample - loss: 1.0217 - accuracy: 0.6317 - val_loss: 0.9473 - val_accuracy: 0.6693
Epoch 7/10
49920/49984 [============================>.] - ETA: 0s - loss: 0.8869 - accuracy: 0.6846
Epoch 00007: val_loss improved from 0.94729 to 0.87422, saving model to Model.hdf5
49984/49984 [==============================] - 280s 6ms/sample - loss: 0.8870 - accuracy: 0.6846 - val_loss: 0.8742 - val_accuracy: 0.6863
Epoch 8/10
49920/49984 [============================>.] - ETA: 0s - loss: 0.7827 - accuracy: 0.7252
Epoch 00008: val_loss improved from 0.87422 to 0.73891, saving model to Model.hdf5
49984/49984 [==============================] - 280s 6ms/sample - loss: 0.7827 - accuracy: 0.7252 - val_loss: 0.7389 - val_accuracy: 0.7402
Epoch 9/10
49920/49984 [============================>.] - ETA: 0s - loss: 0.6982 - accuracy: 0.7569
Epoch 00009: val_loss did not improve from 0.73891
49984/49984 [==============================] - 269s 5ms/sample - loss: 0.6987 - accuracy: 0.7567 - val_loss: 0.7400 - val_accuracy: 0.7407
Epoch 10/10
49920/49984 [============================>.] - ETA: 0s - loss: 0.6283 - accuracy: 0.7809
Epoch 00010: val_loss improved from 0.73891 to 0.68690, saving model to Model.hdf5
49984/49984 [==============================] - 280s 6ms/sample - loss: 0.6283 - accuracy: 0.7810 - val_loss: 0.6869 - val_accuracy: 0.7661



